In [46]:
import pandas as pd
import numpy as np

In [47]:
# Larger employee dataset
data = {
'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Hannah', 'Ian', 'Jack', 'Kara', 'Liam'],
'Department': ['HR', 'Finance', 'IT', 'HR', 'Finance', 'IT', 'HR', 'Finance', 'IT', 'HR', 'Finance', 'IT'],
'Salary': [50000, 60000, 70000, 52000, 58000, 72000, 55000, 62000, 75000, 51000, 63000, 76000],
'Experience': [2, 5, 8, 3, 4, 10, 4, 6, 12, 1, 7, 15]
}
df = pd.DataFrame(data)
df

       Name Department  Salary  Experience
0     Alice         HR   50000           2
1       Bob    Finance   60000           5
2   Charlie         IT   70000           8
3     David         HR   52000           3
4       Eva    Finance   58000           4
5     Frank         IT   72000          10
6     Grace         HR   55000           4
7    Hannah    Finance   62000           6
8       Ian         IT   75000          12
9      Jack         HR   51000           1
10     Kara    Finance   63000           7
11     Liam         IT   76000          15

1 -> la media dello stipendio e dell'esperienza per ogni dipartimento

In [48]:
grup_dep = df.groupby('Department')
avg_stipedio = grup_dep['Salary'].mean()
avg_exp = grup_dep['Experience'].mean()

avg_stipedio,avg_exp

(Department
 Finance    60750.0
 HR         52000.0
 IT         73250.0
 Name: Salary, dtype: float64,
 Department
 Finance     5.50
 HR          2.50
 IT         11.25
 Name: Experience, dtype: float64)

2 -> trovare i dipendenti con uno stipendio sopra la media del loro dipartimento

In [49]:
df['Media'] = df.groupby('Department')['Salary'].transform('mean')

df_ricchi = df[df['Salary'] > df['Media']]
df_ricchi

      Name Department  Salary  Experience    Media
6    Grace         HR   55000           4  52000.0
7   Hannah    Finance   62000           6  60750.0
8      Ian         IT   75000          12  73250.0
10    Kara    Finance   63000           7  60750.0
11    Liam         IT   76000          15  73250.0

aggiungere una nuova colonna che rappresenta il rank (consiglio cercate la funzione rank di pandas) di ogni dipendente all'interno del suo dipartimento

In [50]:
df['Rank'] = df.groupby('Department')['Salary'].rank()
df['Rank2'] = df['Salary'].rank()
df

       Name Department  Salary  Experience    Media  Rank  Rank2
0     Alice         HR   50000           2  52000.0   1.0    1.0
1       Bob    Finance   60000           5  60750.0   2.0    6.0
2   Charlie         IT   70000           8  73250.0   1.0    9.0
3     David         HR   52000           3  52000.0   3.0    3.0
4       Eva    Finance   58000           4  60750.0   1.0    5.0
5     Frank         IT   72000          10  73250.0   2.0   10.0
6     Grace         HR   55000           4  52000.0   4.0    4.0
7    Hannah    Finance   62000           6  60750.0   3.0    7.0
8       Ian         IT   75000          12  73250.0   3.0   11.0
9      Jack         HR   51000           1  52000.0   2.0    2.0
10     Kara    Finance   63000           7  60750.0   4.0    8.0
11     Liam         IT   76000          15  73250.0   4.0   12.0

Mostrare il fataframe raggruppato per dipartimento e ogni dipendente in ordine dal rank più alto al più basso (rank in base allo stipendio)

In [51]:
df_rank = df.sort_values(by=['Department', 'Rank'], ascending=False) #.reset_index(drop=False)
df_rank

       Name Department  Salary  Experience    Media  Rank  Rank2
11     Liam         IT   76000          15  73250.0   4.0   12.0
8       Ian         IT   75000          12  73250.0   3.0   11.0
5     Frank         IT   72000          10  73250.0   2.0   10.0
2   Charlie         IT   70000           8  73250.0   1.0    9.0
6     Grace         HR   55000           4  52000.0   4.0    4.0
3     David         HR   52000           3  52000.0   3.0    3.0
9      Jack         HR   51000           1  52000.0   2.0    2.0
0     Alice         HR   50000           2  52000.0   1.0    1.0
10     Kara    Finance   63000           7  60750.0   4.0    8.0
7    Hannah    Finance   62000           6  60750.0   3.0    7.0
1       Bob    Finance   60000           5  60750.0   2.0    6.0
4       Eva    Finance   58000           4  60750.0   1.0    5.0

In [52]:
df2 = df.groupby(["Department", 'Name'], group_keys=True).apply(lambda x: x)
df2

C:\Users\danie\AppData\Local\Temp\ipykernel_18292\1353644546.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df2 = df.groupby(["Department", 'Name'], group_keys=True).apply(lambda x: x)

                          Name Department  Salary  Experience    Media  Rank  \
Department Name
Finance    Bob     1       Bob    Finance   60000           5  60750.0   2.0
           Eva     4       Eva    Finance   58000           4  60750.0   1.0
           Hannah  7    Hannah    Finance   62000           6  60750.0   3.0
           Kara    10     Kara    Finance   63000           7  60750.0   4.0
HR         Alice   0     Alice         HR   50000           2  52000.0   1.0
           David   3     David         HR   52000           3  52000.0   3.0
           Grace   6     Grace         HR   55000           4  52000.0   4.0
           Jack    9      Jack         HR   51000           1  52000.0   2.0
IT         Charlie 2   Charlie         IT   70000           8  73250.0   1.0
           Frank   5     Frank         IT   72000          10  73250.0   2.0
           Ian     8       Ian         IT   75000          12  73250.0   3.0
           Liam    11     Liam         IT   76000          15  73250.0   4.0

                       Rank2
Department Name
Finance    Bob     1     6.0
           Eva     4     5.0
           Hannah  7     7.0
           Kara    10    8.0
HR         Alice   0     1.0
           David   3     3.0
           Grace   6     4.0
           Jack    9     2.0
IT         Charlie 2     9.0
           Frank   5    10.0
           Ian     8    11.0
           Liam    11   12.0

In [53]:
# pivot = df.pivot(index=[ 'Department', 'Name'], columns='Rank',values='Rank')
# pivot